server/app/controllers/custom_image_upload_controller.rb

UPDATE "users" SET "picture_url" = ? WHERE "users"."id" = ?  [["picture_url", "https://storage.googleapis.com/secure-zone-bucket/tmp/uploaded_images/1547333659uploaded_pic.jpeg;"], ["id", 1]]
---
    def index
        @user.picture = params[:picture]
        puts "asdf " + @user.picture.to_s
        @user.update_image