server/app/controllers/custom_image_upload_controller.rb

INSERT INTO "entries" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-01-13 05:43:48.987155"], ["updated_at", "2019-01-13 05:43:48.987155"]]
---
    def upload_image
        e = Entry.new do |entry|
          entry.user = @user
          entry.picture = user_params[:picture]
        end
        e.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def set_user
            up = user_params
            @user = User.find(up[:user_id])